УТ/src/Catalogs/CRM_ДействияЯзыковыхМоделей/CRM_ДействияЯзыковыхМоделей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ДействияЯзыковыхМоделей</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВыделиГлавное</name>
      <description>Выдели главное</description>
    </items>
    <items>
      <name>ИзмениТекст</name>
      <description>Измени текст</description>
    </items>
    <items>
      <name>Объясни</name>
      <description>Объясни</description>
    </items>
    <items>
      <name>ОтветьНаВопрос</name>
      <description>Ответь на вопрос</description>
    </items>
    <items>
      <name>Переведи</name>
      <description>Переведи</description>
    </items>
    <items>
      <name>СвойЗапрос</name>
      <description>Свой запрос</description>
    </items>
    <items>
      <name>СтильТекста</name>
      <description>Стиль текста</description>
    </items>
  </predefined>
  <attributes>
    <name>ИзменяетТекст</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемныйПромпт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Иконка</name>
    <comment>Имя картинки из библиотеки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_ДействияЯзыковыхМоделей/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ИзменяетТекст.Доступность = (Не Объект.Предопределенный);
	Элементы.ВыбратьКартинку.Доступность = (Не Объект.Предопределенный);
	Элементы.ВосстановитьПромпт.Видимость = (Объект.Предопределенный);
	
	Если ЗначениеЗаполнено(Объект.Иконка)
		И Метаданные.ОбщиеКартинки.Найти(Объект.Иконка) <> Неопределено Тогда
		Иконка = ПоместитьВоВременноеХранилище(БиблиотекаКартинок[Объект.Иконка], УникальныйИдентификатор);
	КонецЕсли;
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Используется = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КартинкаНажатие(Элемент)
	
	Объект.Иконка = Элемент.Имя;
	Иконка = ПоместитьВоВременноеХранилище(БиблиотекаКартинок[Объект.Иконка], УникальныйИдентификатор);
	Модифицированность = Истина;
	
	Элементы.ВыбратьКартинку.Скрыть();
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьПромптНаСервере()
	Объект.СистемныйПромпт = 
		Справочники.CRM_ДействияЯзыковыхМоделей.ПромптПредопределенного(Объект.ИмяПредопределенныхДанных);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьПромпт(Команда)
	ВосстановитьПромптНаСервере();
КонецПроцедуры



#КонецОбласти
